---
title:
---
#+TITLE: Fall 2016 Workshop
#+DATE: <2016-04-13 Wed>
#+AUTHOR: Unidata Python Development Team
#+EMAIL: python-users@unidata.ucar.edu
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:t
#+OPTIONS: todo:t |:t
#+CREATOR: Emacs 24.5.1 (Org mode 8.3.2)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+LANGUAGE: en
#+SELECT_TAGS: export

- *When*: <2016-10-17 Mon>--<2016-10-19 Wed>
- *Where*: [[http://www.unidata.ucar.edu/about/#visit][UCAR Foothills Lab 4, Room 1201]]

** !Under Construction for Fall 2016 Workshop!

What follows is a tentative workshop schedule for the fall 2016 workshop.

** Workshop Schedule for <2016-10-17 Mon>

|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
|    | Section                                      | IPyNB or Markdown           | Presenter   | Length |     Time |
|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
|  1 | Continental breakfast                        |                             |             |   0:30 | 08:30:00 |
|  2 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/Overview.pdf][Introductions and overview]]                   | presentations/Overview      | Ryan        |   0:20 | 09:00:00 |
|  3 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/git.md][Software carpentry for science w/ git/github]] | presentations/git           | Ryan/Julien |   1:45 | 09:20:00 |
|  4 | Break                                        |                             |             |   0:20 | 11:05:00 |
|  5 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/conda.md][Getting Python packages w/ Conda]]             | presentations/conda | Ryan/Julien |   1:00 | 11:25:00 |
|  6 | Lunch on your own                            |                             |             |   1:15 | 12:25:00 |
|  7 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/jupyter-examples/notebook-examples.ipynb][Jupyter notebook introduction]]                | jupyter-examples            | Ward        |   1:00 | 13:40:00 |
|  8 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/intro-numpy-and-matplotlib.ipynb][Numpy with intro to matplotlib Part 1]]        | intro-numpy-and-matplotlib  | Ryan        |   1:00 | 14:40:00 |
|  9 | Break                                        |                             |             |   0:20 | 15:40:00 |
| 10 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/intro-numpy-and-matplotlib.ipynb][Numpy with intro to matplotlib Part 2]]        | intro-numpy-and-matplotlib  | Ryan        |   1:00 | 16:00:00 |
| 11 | End of day 1                                 |                             |             |        | 17:00:00 |
|----+----------------------------------------------+-----------------------------+-------------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Workshop Schedule for <2016-10-18 Tue>

|----+-------------------------------------------+------------------------+-----------+--------+----------|
|    | Section                                   | IPyNB or Markdown      | Presenter | Length |     Time |
|----+-------------------------------------------+------------------------+-----------+--------+----------|
|  1 | Continental breakfast                     |                        |           |   0:30 | 08:30:00 |
|  2 | [[https://github.com/Unidata/unidata-python-workshop/blob/master/presentations/netcdf-intro.pdf][Introduction to netCDF]]                    | intro_netCDF           | Ward      |   1:05 | 09:00:00 |
|  3 | Break                                     |                        |           |   0:15 | 10:05:00 |
|  4 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/netCDF-Reading.ipynb][Reading netCDF]]                            | reading_netCDF         | Ward      |   0:45 | 10:20:00 |
|  5 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/netCDF-Writing.ipynb][Writing netCDF]]                            | writing_netCDF         | Ward      |   0:45 | 11:05:00 |
|  6 | Lunch on your own                         |                        |           |   1:10 | 11:50:00 |
|  7 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/matplotlib-and-cartopy.ipynb][Basic model data access and visualization]] | matplotlib-and-cartopy | Ryan      |   1:45 | 13:00:00 |
|  8 | Break                                     |                        |           |   0:15 | 14:45:00 |
|  9 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/pythonic-data-analysis.ipynb][What to do when things go wrong]]           |                        | Ward      |   0:45 | 15:00:00 |
| 10 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/pythonic-data-analysis.ipynb][Pythonic Data Analysis]]                    | pythonic-data-analysis | Ryan      |   1:15 | 15:45:00 |
| 11 | End of day 2                              |                        |           |        | 17:00:00 |
|----+-------------------------------------------+------------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Workshop Schedule for <2016-10-19 Wed>

|----+-------------------------------------+--------------------------------------+-----------+--------+----------|
|    | Section                             | IPyNB or Markdown                    | Presenter | Length |     Time |
|----+-------------------------------------+--------------------------------------+-----------+--------+----------|
|  1 | Continental breakfast               |                                      |           |   0:30 | 08:30:00 |
|  2 | Siphon [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/SIPHON_NCSS_Example.ipynb][Part 1]], [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/Siphon Radar Server.ipynb][Part 2]]               | SIPHON*                              | Ryan      |   1:00 | 09:00:00 |
|  3 | Break                               |                                      |           |   0:15 | 10:00:00 |
|  4 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/MetPy Units and Upper Air.ipynb][MetPy Units and Upper Air]]           | MetPy Units and Upper Air            | Ryan      |   1:00 | 10:15:00 |
|  5 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/GINI Satellite with MetPy and Siphon.ipynb][Accessing GINI Satellite Data]]       | GINI Satellite with MetPy and Siphon | Ryan      |   1:00 | 11:15:00 |
|  6 | Lunch on your own                   |                                      |           |   1:15 | 12:15:00 |
|  7 | [[http://nbviewer.jupyter.org/github/Unidata/unidata-python-workshop/blob/master/notebooks/Surface Data with Siphon and MetPy.ipynb][Surface Data with Siphon and MetPy]]  | Surface Data with Siphon and MetPy   | Ryan      |   1:00 | 13:30:00 |
|  8 | Break                               |                                      |           |   0:15 | 14:30:00 |
|  9 | Python AWIPS Data Access Framework  |                                      | Michael   |   0:45 | 14:45:00 |
| 10 | Collaborative development on github |                                      | Julien    |   0:45 | 15:30:00 |
| 11 | End of day 3                        |                                      |           |        | 16:15:00 |
|----+-------------------------------------+--------------------------------------+-----------+--------+----------|
#+TBLFM: @3$6..@-1$6=@-1$5+@-1$6;T::$1=@#-1

** Please give us your feedback

Your feed back is greatly appreciated! Please feel free to use the [[http://www.unidata.ucar.edu/community/surveys/2015training/survey.html][survey]] as often as you like, at any time during or after the class as comments come to mind.
